[
    {"id": "623853b2614ad5aba311fdd1",
        "name":"Kristen Luchene" ,
        "review": "I love almost everything about this laptop except the camera quality. It'd be nice if there's a way to know to enhance camera quality on this device. Other than that, it's a great product"
        
},
    {"id": "623853b2614ad5aba311fde2",
        "name": "Chelsea Johnston",
        "review": "I just got it. Nice to hear your positive review!"
        
        
},
    {"id": "623853b2614ad5aba311fdf3",  
       
        "name": "Jhon Michael",
        "review" :"I don't know why companies like Samsung put AMAZINGLY MIND BLOWING cameras in their phones and still put garbage in their laptops! It does. not. make. sense!!!Everything else looks great!"
        
},
    {"id": "623853b2614ad5aba311fdd4",
        "name": "Anon e-mouse",
        "review": "The battery reducing to zero over night is a real concern. I hope they can do something to fix this."
        
        
},
    {"id": "623853b2614ad5aba311fdse5",
        "name": "Matthias Heil",
        "review": "I have switched from a Surface Pro 7 i7 16GB 1TB, and find this incredible piece of Samsung hardware to be a real killer in almost any aspect. Battery!!! Display!!! S Pen!!! Thanks for the honest review. I have quite some video editing to do (Filmora Pro), and have far less problems then on my former device."
        
},
    {"id": "623853b2614ad5aba311fde6",
        "name": "",
        "review": "Ana Martinez 11 months ago (edited) Thank you so much for the review! I just bought mine and I have two concerns that I would like to know whether you or anyone had the same experience.The first is that the touchpad click is triggering a metallic sound as if some keys on the keyboard were loose, indeed I just discovered that if I hold the space tab while clicking, the noise disappears. Is that a thing in this laptop or I got a defected device? The left click is making the noise more than the right click. The second is that the HDMI port seems not to work in terms of transferring the audio to the TV or monitor. I have tried two different HDMI cables and the computer transfers the video but not the sound. I have checked the sound settings under Device Manager and also under Sound. The drivers are up to date as well as software, etc, and still the audio is not transferred automatically nor I have the option to choose HDMI audio output manually, only the integrated Sound output (Speakers Realtek Audio) is showing. Under Sound- Playback only the Speakers and Headphones are showing but the HDMI icon is not appearing either under disable or disconnected. I have to mention that the same TV works perfectly and the audio is being transferred without installing any extra thing with both HDMI cables and 3 other different computers (Apple, Lenovo and Acer) and Windows 10."
       
        
}
]